IDEA StatiCa Open Model
Material.StateOfThermalExpansion Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 State of thermal expansion curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ThermalExpansionState StateOfThermalExpansion { get; set; }
Public Property StateOfThermalExpansion As ThermalExpansionState
	Get
	Set
public:
property ThermalExpansionState StateOfThermalExpansion {
	ThermalExpansionState get ();
	void set (ThermalExpansionState value);
}
Property Value
Type: ThermalExpansionState
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace